
---
title: احراز هویت چندگانه در فریمورک لاراول (ویدئوهای شماره‌ی 3 و 4 اضافه شدن)
date: 2019-11-15 20:50:00
category: برنامه نویسی
layout: post
tags: برنامه‌نویسی پی‌اچ‌پی لاراول احرازهویت‌چندگانه
timeToRead: 5
---

مدت خیلی زیادی بود که قصد داشتم یه سری ویدئوکست در مورد موضوع احراز هویت چندگانه تو فریمورک لاراول ضبط کنم ولی هر دفعه یه مشکلی پیش میومد یا ویدئوها مورد دلخواهم نبود.

حقیقت قضیه اینجاست که ویدئوکست ضبط کردن خیلی سخت‌تر از چیزیه که ممکنه فکرشو بکنید. بزرگترین مشکل هم توضیحات انحرافی زیاد (یا به قولی جواد خیابانی طور) و در نتیجه طولانی شدن ویدئوها بود. در نهایت یه بار هم که خوب ضبط کردم چند قسمت رو اومدم ادیتشون کنم فهمیدم موقع ضبط میکروفون لپ‌تاپم خاموش بوده و همه‌ی ویدئوها بی صدان :)))))


